# ForeignFileFailures Properties

---
The BuiltInFailuresForeignFileFailures type exposes the following members.
| Name| Description
---|---|---
| ForeignFile|  This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk.
| ForeignLink|  This file [RvtLinkName] was saved by an application that was not developed or licensed by Autodesk.
Top
#### Reference
BuiltInFailuresForeignFileFailures Class
Autodesk.Revit.DB Namespace